Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: an external text file (YAML, JSON, XML, custom)
it_it: un file di testo esterno (YAML, JSON, XML, personalizzato)

source: and an addition thread `_g2d_render_thread_cb()` will be spawned in order to handle the supported draw tasks.
it_it: e verrà generato un thread aggiuntivo `_g2d_render_thread_cb()` per gestire le attività di disegno supportate.

source: and an addition thread `_pxp_render_thread_cb()` will be spawned in order to handle the supported draw tasks.
it_it: e verrà generato un thread aggiuntivo `_pxp_render_thread_cb()` per gestire i task di disegno supportati.

source: and an addition thread `_vglite_render_thread_cb()` will be spawned in order to handle the supported draw tasks.
it_it: e verrà generato un thread aggiuntivo `_vglite_render_thread_cb()` per gestire le attività di disegno supportate.

source: and ensure the main header file i.e., ``editor_project.h`` is included relatively:
it_it: e assicurarsi che il file header principale, ovvero ``editor_project.h``, sia incluso relativamente:

source: and followed by 1 blank line.
it_it: e seguito da una riga vuota.

source: and on the likelihood that they are used less frequently than the medium-sized fonts, the performance cost will be smaller.
it_it: e, dato che probabilmente vengono utilizzati meno frequentemente rispetto ai font di medie dimensioni, il costo in termini di prestazioni sarà inferiore.

source: and the state of the button (pressed or released)
it_it: e lo stato del pulsante (premuto o rilasciato)

source: any
it_it: qualsiasi

source: any external input source (e.g. serial)
it_it: qualsiasi sorgente di input esterna (ad esempio seriale)

source: are represented on the display as:
it_it: sono rappresentati sul display come:

source: argument with > 1 word
it_it: argomento con > 1 parola

source: assign a :ref:`flush_callback` for it.
it_it: assegnargli una :ref:`flush_callback`.

source: assign its :ref:`draw_buffers`, and
it_it: assegnare i relativi :ref:`draw_buffers`, e

source: asterisk
it_it: asterisco

source: attaches it to the Subject,
it_it: lo associa al Subject,

source: attacks
it_it: attacchi personali o politici

source: attention or advances
it_it: avances sessuali indesiderate

source: autocompletion speeds up writing XML,
it_it: il completamento automatico velocizza la scrittura dell'XML,

source: avoid escaping ``"`` character in the JSON file
it_it: evitare di usare il carattere ``"`` nel file JSON

source: background image style
it_it: stile dell'immagine di background

source: be exported to C code by LVGL's UI Editor and compiled with the application.
it_it: essere esportati in codice C dall'UI Editor di LVGL e compilati con l'applicazione.

source: be loaded at runtime from XML, or
it_it: essere caricati a runtime da XML oppure

source: because the thread that drives both of these is the thread that calls :cpp:func:`lv_timer_handler`.
it_it: perché il thread che gestisce entrambi è il thread che chiama :cpp:func:`lv_timer_handler`.

source: begin it with "BREAKING CHANGE" if the changes break the API;
it_it: iniziare con "BREAKING CHANGE" se le modifiche 'rompono' l'API;

source: bidirectional, BiDi) text rendering as well.
it_it: bidirezionale, BiDi).

source: bin (contains all binaries (\*.dll))
it_it: bin (contiene tutti i binari (\*.dll))

source: bit-mask being applied
it_it: applicazione di una maschera di bit

source: blend mode
it_it: modalità blend

source: brevity (the quality of using few words when speaking or writing).
it_it: brevità (la qualità di usare poche parole quando si parla o si scrive).

source: bytes of RAM is required from the LVGL heap.
it_it: sono richiesti byte di RAM dall'heap LVGL.

source: bytes of RAM, and it needs to be combined with the :ref:`image caching` feature to ensure that the memory usage is within a reasonable range.
it_it: byte di RAM e deve essere combinato con la funzionalità di :ref:`image caching` per garantire che l'utilizzo della memoria rientri in un intervallo ragionevole.

source: can be any non-negative value including 0
it_it: può essere qualsiasi valore non negativo, incluso 0

source: can be defined.
it_it: da poter definire.

source: can be used as well.
it_it: Possono essere utilizzati.

source: carries details of the drawing to be performed
it_it: [descrittore del disegno] contiene i dettagli del disegno da eseguire

source: center the Component,
it_it: centrare il Componente,

source: change the background of the Editor's preview to dark,
it_it: cambiare il background dell'anteprima dell'editor in scuro,

source: change the size of the preview.
it_it: modificare le dimensioni dell'anteprima.

source: check size and position by dragging
it_it: controllare le dimensioni e la posizione col trascinamento

source: check size and position by dragging,
it_it: controllare le dimensioni e la posizione trascinando,

source: clarity (the ease with which other programmers can understand your intention),
it_it: chiarezza (la facilità con cui altri programmatori possono comprendere le vostre intenzioni),

source: clipped corners (a bit-mask application)
it_it: angoli ritagliati (applicazione di una maschera di bit)

source: closed with the subject: *name*, *size*, *state* etc.
it_it: chiuso col soggetto: *name*, *size*, *state* ecc.

source: code is also exported by parsing the XML files
it_it: il codice viene esportato anche analizzando i file XML

source: code-block:: is the only directive that should be used.
it_it: code-block:: è l'unica direttiva da utilizzare.

source: color
it_it: colore

source: compute which :ref:`Draw Unit <draw units>` should receive this task, and
it_it: calcolare quale :ref:`Draw Unit <draw units>` deve ricevere questo task, e

source: constants
it_it: costanti

source: container:: tighter-table-N directive (N = digit 1-7 with 7 being the tightest), and indent your table to make it the "content" of the directive.
it_it: container:: tighter-table-N (N = cifre da 1 a 7, dove 7 è la più stretta) e indentarla per renderla "il contenuto" della direttiva.

source: contains "log output" of the internal actions taken and their results.
it_it: contiene il "log dell'output" delle azioni interne intraprese e dei relativi risultati.

source: contains list of the Observer-Pattern Subjects implemented in your XML source files.
it_it: contiene l'elenco dei argomenti Subject Observer-Pattern implementati nei file sorgente XML.

source: crowns,
it_it: crown [rotellina],

source: data that is used to draw an image to a Display.
it_it: a dati utilizzati per disegnare un'immagine su un display.

source: day names have no border, no background and are drawn with a gray color
it_it: I nomi dei giorni non hanno bordo, non hanno sfondo e sono visualizzati in grigio.

source: days of the previous and next month have the :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_DISABLED` flag
it_it: I giorni del mese precedente e successivo hanno il flag :cpp:enumerator:`LV_BUTTONMATRIX_CTRL_DISABLED`

source: default 10
it_it: il default è 10

source: default 3 and 5 respectively
it_it: rispettivamente 3 e 5 di default

source: default height of approximately 1/10 inch (according to configured value of :c:macro:`LV_DPI_DEF`).
it_it: altezza di default di circa 1/10 di pollice (in base al valore configurato di :c:macro:`LV_DPI_DEF`).

source: default range of [0..100],
it_it: intervallo di default di [0..100],

source: default width of approximately 2 inches (according to configured value of :c:macro:`LV_DPI_DEF`),
it_it: larghezza di default di circa 2 pollici (in base al valore configurato di :c:macro:`LV_DPI_DEF`),

source: defines the drawing algorithm involved (e.g. line, fill, border, image, label, arc, triangle, etc.)
it_it: definisce l'algoritmo di disegno utilizzato (ad esempio, linea, riempimento, bordo, immagine, etichetta, arco, triangolo, ecc.)

source: defines the rectangle in which drawing will occur
it_it: definisce il rettangolo in cui verrà eseguito il disegno

source: different objects.
it_it: oggetti diversi.

source: direct access to drawing buffer
it_it: accesso diretto al buffer di disegno

source: direct or partial render mode
it_it: modalità di rendering diretta o parziale

source: display flexible axes with ticks and text
it_it: visualizzare assi flessibili con tacche e testo

source: do not transform the children of the Image Widget, and
it_it: non trasformano gli elementi figlio del Widget Image e

source: don't capitalize the first letter;
it_it: non usare la maiuscola per la prima lettera;

source: double click to jump to the XML file
it_it: fare doppio clic per passare al file XML

source: double click to jump to the XML file,
it_it: fare doppio clic per passare al file XML,

source: dynamically allocates an Observer object,
it_it: alloca dinamicamente un oggetto Observer,

source: e2 Studio Toolbar with LVGL Editor Plugin
it_it: La Toolbar di e2 Studio col Plugin LVGL Editor

source: eLCDIF is a peripheral that is provided on some of the NXP devices capable to drive display panels through the RGB interface, it supports different color depths and, on MIPI-DSI capable devices, its output ca be directed to the MIPI display physical interface.
it_it: eLCDIF è una periferica presente su alcuni dispositivi NXP in grado di pilotare pannelli di display tramite l'interfaccia RGB, supporta diverse profondità di colore e, sui dispositivi compatibili con MIPI-DSI, il suo output può essere indirizzato all'interfaccia fisica del display MIPI.

source: each Widget will now have a ``void *`` field called ``id``;
it_it: ogni Widget avrà ora un campo ``void *`` chiamato ``id``;

source: electronic address, without explicit permission
it_it: elettronico, senza esplicita autorizzazione

source: enable a button if some conditions are met (e.g. the correct PIN is entered)
it_it: abilitare un pulsante se vengono soddisfatte determinate condizioni (ad esempio, viene inserito il PIN corretto)

source: encoders,
it_it: encoder,

source: end on an ``Nx8 - 1`` coordinate.
it_it: terminano con una coordinata ``Nx8 - 1``.

source: enter your email address
it_it: inserire il proprio indirizzo email

source: equal
it_it: uguale

source: esp_lcd natively supports some `basic displays <https://github.com/espressif/esp-idf/tree/master/components/esp_lcd/src>`__
it_it: esp_lcd supporta nativamente alcuni `display di base <https://github.com/espressif/esp-idf/tree/master/components/esp_lcd/src>`__

source: etc.
it_it: ecc.

source: even LED matrices
it_it: anche matrici di LED

source: events
it_it: eventi

source: fast enough: the difference between the current and the previous point must be greater than ``indev->gesture_min_velocity``
it_it: abbastanza veloce: la differenza tra il punto corrente e quello precedente deve essere maggiore di ``indev->gesture_min_velocity``

source: fire events based on user input (and other things),
it_it: generare eventi in base all'input dell'utente (e altre cose),

source: flag (or OR-ed combination of flags) from from the ``LV_OBJ_FLAG_...`` enumeration values;
it_it: flag (o combinazione di flag con OR) dai valori dell'enumerazione ``LV_OBJ_FLAG_...``;

source: float Subject
it_it: Subject float

source: followed by module name: *button*, *label*, *style* etc.
it_it: seguiti dal nome del modulo: *button*, *label*, *style* ecc.

source: followed by the action (for functions): *set*, *get*, etc.
it_it: seguiti dall'azione (per le funzioni): *set*, *get*, ecc.

source: fonts
it_it: font

source: for Linux: `here <https://www.renesas.com/us/en/document/swo/e2-emulator-e2-emulator-lite-linux-driver?r=488806>`__
it_it: per Linux: `qui <https://www.renesas.com/us/en/document/swo/e2-emulator-e2-emulator-lite-linux-driver?r=488806>`__

source: for Windows: `64 bit here <https://www.renesas.com/us/en/document/uid/usb-driver-renesas-mcu-tools-v27700-64-bit-version-windows-os?r=488806>`__ and `32 bit here <https://www.renesas.com/us/en/document/uid/usb-driver-renesas-mcu-toolse2e2-liteie850ie850apg-fp5-v27700for-32-bit-version-windows-os?r=488806>`__
it_it: per Windows: `64 bit qui <https://www.renesas.com/us/en/document/uid/usb-driver-renesas-mcu-tools-v27700-64-bit-version-windows-os?r=488806>`__ e `32 bit qui <https://www.renesas.com/us/en/document/uid/usb-driver-renesas-mcu-toolse2e2-liteie850ie850apg-fp5-v27700for-32-bit-version-windows-os?r=488806>`__

source: for example:
it_it: per esempio:

source: for orientation, width and height, simply set width and height properties;
it_it: per orientamento, larghezza e altezza, è sufficiente impostare le proprietà width e height;

source: for orientation, width and height, simply set width and height style properties;
it_it: Per orientamento, larghezza e altezza, è sufficiente impostare le proprietà di stile width e height;

source: fsl_cache.c: CPU cache handling functions
it_it: fsl_cache.c: Funzioni di gestione della cache della CPU

source: fsl_pxp.c: PXP driver
it_it: fsl_pxp.c: Driver PXP

source: functions that set :ref:`local style properties <style_local>` directly on objects (needs a wrapper to set the *selector*)
it_it: funzioni che impostano le :ref:`proprietà di stile locali <style_local>` direttamente sugli oggetti (necessita di un wrapper per impostare il *selector*)

source: give the Draw Unit all the information required to accomplish the drawing task.
it_it: fornire alla Draw Unit tutte le informazioni necessarie per completare il task di disegno.

source: glTF (Graphics Library Transmission Format) is a 3D file format that stores 3D model information in JSON format.
it_it: glTF (Graphics Library Transmission Format) è un formato di file 3D che memorizza le informazioni del modello 3D in formato JSON.

source: glTF files can be stored as:
it_it: I file glTF possono essere memorizzati come:

source: gradient types.
it_it: di gradienti.

source: greater than
it_it: maggiore di

source: greater than or equal
it_it: maggiore o uguale

source: has its value changed
it_it: ne viene modificato un suo stesso valore

source: highlight any user-defined dates.
it_it: evidenziare eventuali date definite dall'utente.

source: highlight the current day (today);
it_it: evidenziare il giorno corrente (today);

source: horizontal orientation, with
it_it: orientamento orizzontale, con

source: how much the knob was turned
it_it: quanto è stata ruotata la manopola

source: how to send those rendered pixels to it (:ref:`flush_callback`).
it_it: come inviargli tali pixel renderizzati (:ref:`flush_callback`).

source: html#classes>`_" chapter in the Yocto Project Reference Manual provides details about classes and how to use them.
it_it: html#classes>`_" nel Manuale di Riferimento del Progetto Yocto fornisce dettagli sulle classi e su come utilizzarle.

source: html#working-with-a-pr-service>`_" section in the Yocto Project Development Tasks Manual for more information.
it_it: html#working-with-a-pr-service>`_" nello Yocto Project Development Tasks Manual.

source: i.e., ``lv_fs_read`` may call the driver's ``seek`` so the driver needs to implement more callbacks when the cache is enabled.
it_it: ad esempio, ``lv_fs_read`` potrebbe chiamare ``seek`` del driver, quindi il driver deve implementare più callback quando la cache è abilitata.

source: i.e: ``#include <lvgl.h>``.
it_it: Ad esempio: ``#include <lvgl.h>``.

source: identifier of the Draw Unit that should carry out this task
it_it: identificatore della Draw Unit che deve eseguire questa attività

source: if :c:macro:`LV_DRAW_TRANSFORM_USE_MATRIX` is configured to '1'
it_it: [matrice di trasformazione] Se :c:macro:`LV_DRAW_TRANSFORM_USE_MATRIX` è configurato a '1'

source: if ``auto_del`` is ``true`` the previous screen is automatically deleted when any transition animation finishes.
it_it: se ``auto_del`` è ``true``, lo Screen precedente viene automaticamente eliminata al termine di qualsiasi animazione di transizione.

source: if a non-zero repeat count has been set, it has repeated the Animation that number of times.
it_it: se è stato impostato un conteggio di ripetizioni diverso da zero, l'Animazione è stata ripetuta per quel numero di volte.

source: if it can accomplish that type of task (e.g. line drawing) faster than other Draw Units that have already reported, it writes its own "preference score" and "preferred Draw Unit ID" to the respective fields in the task.
it_it: se riesce a svolgere quel tipo di task (ad esempio, disegnare una linea) più velocemente di altre Draw Unit che hanno già segnalato, scrive il proprio "punteggio di preferenza" e il proprio "preferred Draw Unit ID" nei rispettivi campi nel task.

source: if the Animation has a non-zero *reverse* duration value, then its value has run from the ``end`` value back to the ``start`` value again;
it_it: se l'Animazione ha un valore di durata *inversa* diverso da zero, il suo valore è stato eseguito dal valore ``end`` al valore ``start``;

source: image width |times| image height |times| 3
it_it: larghezza immagine |times| altezza immagine |times| 3

source: important
it_it: importante

source: in :ref:`flush_callback`, truncate and modify the ``area`` parameter for each display; and
it_it: in :ref:`flush_callback`, troncando e modificando il parametro ``area`` per ciascun display; e

source: in the ``.c`` file: the ``#include`` that includes the header with the closest correspondence to that ``.c`` file
it_it: nel file ``.c``: l'``#include`` che include l'header con la corrispondenza più vicina a quel file ``.c``

source: in the mated ``.h`` file: ``#include "lv_conf_internal.h"``
it_it: nel file ``.h`` corrispondente: ``#include "lv_conf_internal.h"``

source: in which direction
it_it: in quale direzione

source: include/lvgl (contains all public headers)
it_it: include/lvgl (contiene tutti gli header pubblici)

source: include: /include/external_links.txt once at the top of each .rst file that uses it.
it_it: includere: /include/external_links.txt una volta all'inizio di ogni file .rst che lo utilizza.

source: index.rst Files
it_it: File index.rst

source: integer Subject
it_it: Subject integer

source: into a single call.
it_it: in un'unica chiamata.

source: is clicked
it_it: viene cliccato

source: is designed for native Windows desktop application development,
it_it: è progettata per lo sviluppo di applicazioni desktop Windows native,

source: is designed for simulating LVGL rendering on hardware-like displays,
it_it: è progettata per simulare il rendering LVGL su display di tipo hardware,

source: is redrawn, etc.
it_it: viene ridisegnato, ecc.

source: is scrolled
it_it: viene fatto scorrere

source: is the Personal Access Token that you can generate as described in the `Manage Personal Access Tokens <https://help.figma.com/hc/en-us/articles/ 8085703771159-Manage-personal-access-tokens>`__ article in Figma documentation.
it_it: è il "Personal Access Token" generabile come descritto nell'articolo `Manage Personal Access Tokens <https://help.figma.com/hc/en-us/articles/ 8085703771159-Manage-personal-access-tokens>`__ nella documentazione di Figma.

source: is the string after "design" in the Figma URL.
it_it: è la stringa dopo "design" nell'URL di Figma.

source: it is also possible to speed-up the execution of the critical code of the LVGL, by telling the compiler to put these sections on the IRAM area of ESP32 chips setting the following option:
it_it: È anche possibile velocizzare l'esecuzione del codice critico dell'LVGL, indicando al compilatore di posizionare queste sezioni nell'area IRAM dei chip ESP32 impostando la seguente opzione:

source: it will create a user for you (no password is needed)
it_it: verrà creato un account utente (non è necessaria alcuna password)

source: its "value" has reached the designated ``end`` value;
it_it: il suo "valore" ha raggiunto il valore ``end`` designato;

source: its pixel format and size (:ref:`creating_a_display`),
it_it: il formato e la dimensione dei pixel (:ref:`creating_a_display`),

source: keeps LVGL display resolution constant to simulate production UI layouts, and
it_it: mantiene costante la risoluzione del display LVGL per simulare i layout dell'interfaccia utente di produzione e

source: keyboards,
it_it: keyboard,

source: keypads,
it_it: keypad,

source: large enough: the difference between the first and the current point must be greater than ``indev->gesture_limit``
it_it: abbastanza ampio: la differenza tra il primo punto e quello corrente deve essere maggiore di ``indev->gesture_limit``

source: least
it_it: minima

source: length of ``data`` in bytes
it_it: lunghezza di ``data`` in byte

source: less
it_it: meno

source: less than
it_it: minore di

source: less than or equal
it_it: minore o uguale di

source: lib (contains all precompiled source files (\*.lib))
it_it: lib (contiene tutti i file sorgente precompilati (\*.lib))

source: libinput Example
it_it: Esempio di libinput

source: libjpeg-turbo Decoder
it_it: Decoder libjpeg-turbo

source: libpng Decoder
it_it: Decoder libpng

source: libuv apps can integrate seamlessly.
it_it: Le app libuv possono integrarsi perfettamente.

source: line 1
it_it: riga 1

source: line 55
it_it: riga 55

source: line 64
it_it: riga 64

source: line break characters are ignored, and
it_it: i caratteri di interruzione di riga vengono ignorati e

source: lines to align with item text like this.
it_it: righe successive per allinearle al testo dell'elemento, in questo modo.

source: list item, it must be intended to align with the list item like this:
it_it: voce di elenco, è necessario allinearli alla voce di elenco in questo modo:

source: list of :ref:`Display(s) <display_overview>`
it_it: elenco di :ref:`Display <display_overview>`

source: list of :ref:`Draw Units`
it_it: elenco di :ref:`Draw Units`

source: lone ellipsis
it_it: singoli puntini di sospensione

source: lv_ime_pinyin has the following modes:
it_it: lv_ime_pinyin ha le seguenti modalità:

source: lvgl (the actual library, required)
it_it: lvgl (la libreria vera e propria, obbligatoria)

source: lvgl recipe version
it_it: Versione della ricetta lvgl

source: lvgl_demos (some demos, optional)
it_it: lvgl_demos (alcune demo, facoltative)

source: lvgl_examples (example usages, optional)
it_it: lvgl_examples (esempi di utilizzo, facoltativi)

source: lvgl_thorvg (a vector graphics extension, optional)
it_it: lvgl_thorvg (un'estensione per la grafica vettoriale, facoltativa)

source: make it possible to control the UI (or parts of it, e.g. animation) via external input, without modifying firmware, such as:
it_it: rendere possibile il controllo dell'interfaccia utente (o parti di essa, ad esempio l'animazione) tramite input esterno, senza modificare il firmware, come:

source: max 90 characters.
it_it: massimo 90 caratteri.

source: mice,
it_it: mouse,

source: most
it_it: la maggior parte

source: most of the widget properties
it_it: la maggior parte delle proprietà dei widget

source: needed for debugging)
it_it: necessario per il debug)

source: new level to align with its parent list item like this:
it_it: nuovo livello per allinearlo alla voce di elenco padre in questo modo:

source: no period (``.``) at the end;
it_it: nessun punto (``.``) alla fine;

source: not equal
it_it: diverso

source: not passing the ``--no-compress`` flag to the offline converter (compression is applied by default)
it_it: non passando il flag ``--no-compress`` al convertitore offline (la compressione viene applicata per default)

source: note
it_it: nota

source: notify a label to refresh its text according to one or more variables (e.g. current time)
it_it: notificare a un'etichetta di aggiornare il testo in base a una o più variabili (ad esempio, l'ora corrente)

source: now ``pre-commit`` will run automatically on ``git commit``!
it_it: ora ``pre-commit`` verrà eseguito automaticamente su ``git commit``!
